app/Controllers/Auth.php

UPDATE `user` SET `is_login` = '0', `terakhir_login` = '2024-06-25 15:10:30'
WHERE `username` = 'rahmatzanova'
---
    public function logout()
    {
        date_default_timezone_set('ASIA/JAKARTA');
        $terakhir_login = date('Y-m-d H:i:s');
        $username = session()->get('username');
        $builder = $this->db->table('user');
        $builder->set('is_login', '0');
        $builder->set('terakhir_login', $terakhir_login);
        $builder->where('username', $username);
        $builder->update();