app/Controllers/Kategori.php

SELECT *
FROM `kategori`
---
    public function index()
    {
        $semuaKategori = $this->kategoriModel->find();