app/Controllers/Menu.php

INSERT INTO `menu` (`nama_menu`, `url`, `level`, `jenis`, `is_active`, `no_urut`, `created_at`, `updated_at`) VALUES ('Tentang Kami', 'tentang-kami', 'single_menu', NULL, 1, '1', '2024-06-11 20:46:40', '2024-06-11 20:46:40')
---
            'is_active' => true,
            'no_urut' => $this->request->getVar('no_urut')
        );
        $this->menuModel->insert($data);