app/Controllers/PenghuniKamar.php

    public function simpan()
    {
        if(!$this->validate([
            'id_siswa' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Pilih Mata Pelajaran !',
                ]
            ],
            'id_kamar' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Pilih Kamar !'
                ]
            ],
        ])){
            return redirect()->back()->withInput();
        }

        $data = array(
            'id_kamar' => $this->request->getVar('id_kamar'),
        );
        $id = $this->request->getVar('id_siswa');
        $this->siswaModel->where('id', $id)->set($data)->update();
---
UPDATE `siswa` SET `id_kamar` = '4', `updated_at` = '2024-06-11 20:43:15'
WHERE `id` = '4'

            'keterangan' => 'masuk'
        );

        $this->historiKamarSiswaModel->insert($dataHistori);
---
INSERT INTO `histori_kamar_siswa` (`id_siswa`, `id_kamar`, `keterangan`, `created_at`, `updated_at`) VALUES ('4', '4', 'masuk', '2024-06-11 20:43:15', '2024-06-11 20:43:15')