app/Models/AuthModel.php

    public function login($username)
    {
        $builder = $this->db->table('user');
        $builder->select('user.*,user_level.user_level_nama');
        $builder->join('user_level', 'user_level.user_level_id = user.level');
        $builder->where('username', $username);
        $query = $builder->get();
---
SELECT `user`.*, `user_level`.`user_level_nama`
FROM `user`
JOIN `user_level` ON `user_level`.`user_level_id` = `user`.`level`
WHERE `username` = 'rahmatzanova'