app/Models/BeritaModel.php

SELECT `berita`.*, `user`.`nama_asli` as `nama_user`, `kategori`.`kategori_nama` as `nama_kategori`
FROM `berita`
JOIN `user` ON `berita`.`berita_penulis` = `user`.`user_id`
JOIN `kategori` ON `berita`.`berita_kategori` = `kategori`.`kategori_id`
WHERE `berita_penulis` = '1'
AND `berita_kategori` = 2
ORDER BY `berita_id` DESC
---
    public function getAllByAdmin($whereLevel = null, $kategori = null)
    {
        $builder = $this->db->table('berita');
        $builder->select('berita.*, user.nama_asli as nama_user, kategori.kategori_nama as nama_kategori');
        if($whereLevel != null){
            $builder->where('berita_penulis', $whereLevel);
        }
        if($kategori != null){
            $builder->where('berita_kategori', $kategori);
        }else {
            $builder->where('berita_kategori !=', '2');
        }
        $builder->join('user', 'berita.berita_penulis = user.user_id');
        $builder->join('kategori', 'berita.berita_kategori = kategori.kategori_id');
        $builder->orderBy('berita_id', 'DESC');
        $result = $builder->get();