app/Models/DashboardModel.php

    public function totalBerita()
    {
        return $this->db->table('berita')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `berita`

    public function totalAgenda()
    {
        return $this->db->table('agenda')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `agenda`