app/Models/HalamanModel.php

SELECT `halaman`.*, `menu`.`nama_menu` as `nama_menu`, `user`.`nama_asli` as `nama_penulis`
FROM `halaman`
JOIN `menu` ON `halaman`.`menu_id` = `menu`.`kode_menu`
JOIN `user` ON `halaman`.`penulis` = `user`.`user_id`
---
    public function getAllByAdmin()
    {
        $builder = $this->db->table('halaman');
        $builder->select('halaman.*, menu.nama_menu as nama_menu, user.nama_asli as nama_penulis');
        $builder->join('menu', 'halaman.menu_id = menu.kode_menu');
        $builder->join('user', 'halaman.penulis = user.user_id');
        $result = $builder->get();