app/Models/KamarModel.php

    public function getAllByAdmin()
    {
        $builder = $this->db->table('kamar');
        $builder->select('*');
        $result = $builder->get();
---
SELECT *
FROM `kamar`