app/Models/KelasModel.php

SELECT *
FROM `kelas`
---
    public function getAllByAdmin()
    {
        $builder = $this->db->table('kelas');
        $builder->select('*');
        $result = $builder->get();