app/Models/MenuModel.php

    public function getAll()
    {
        $builder = $this->db->table('menu');
        $builder->select('menu.*, join_menu.nama_menu as nama_join_menu');
        $builder->join('menu join_menu','menu.main_menu = join_menu.kode_menu','left');
        $builder->orderBy('no_urut', 'ASC');
        $result = $builder->get();
---
SELECT `menu`.*, `join_menu`.`nama_menu` as `nama_join_menu`
FROM `menu`
LEFT JOIN `menu` `join_menu` ON `menu`.`main_menu` = `join_menu`.`kode_menu`
ORDER BY `no_urut` ASC

    public function getAllMenuUntukTambahHalaman()
    {
        $builder = $this->db->table('menu');
        $builder->select('*');
        $builder->where('is_active', 1);
        $builder->groupStart();
        $builder->where('level', 'sub_menu');
        $builder->orWhere('level', 'single_menu');
        $builder->groupEnd();
        $builder->orderBy('no_urut', 'ASC');
        $result = $builder->get();
---
SELECT *
FROM `menu`
WHERE `is_active` = 1
AND   (
`level` = 'sub_menu'
OR `level` = 'single_menu'
 )
ORDER BY `no_urut` ASC