app/Models/PelajaranModel.php

SELECT *
FROM `pelajaran`
---
    public function getAllByAdmin()
    {
        $builder = $this->db->table('pelajaran');
        $builder->select('*');
        $result = $builder->get();