app/Models/PenyimpananGambarModel.php

    public function getAll($limit = null)
    {
        $builder = $this->db->table('penyimpanan_gambar');
        $builder->select('*');
        $result = $builder->get();
---
SELECT *
FROM `penyimpanan_gambar`