app/Models/SiswaModel.php

    public function cekVerifikasiSantri($username)
    {
        $builder = $this->db->table('siswa');
        $builder->select('status');
        $builder->where('username', $username);
        $result = $builder->get();
---
SELECT `status`
FROM `siswa`
WHERE `username` = 'rahmatzanova'

    public function getAllPendaftarByAdmin($tahun = null)
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*');
        $builder->where('status',1);
        if($tahun != null) {
            $builder->where('tahun_pendaftaran',$tahun);
        }
        $builder->orderBy('id', 'DESC');
        $result = $builder->get();
---
SELECT `siswa`.*
FROM `siswa`
WHERE `status` = 1
ORDER BY `id` DESC

    public function getAllSiswaTerdaftarByAdmin($tahun = null)
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*');
        $builder->where('status',3);
        if($tahun != null) {
            $builder->where('tahun_pendaftaran',$tahun);
        }
        $builder->orderBy('id', 'DESC');
        $result = $builder->get();
---
SELECT `siswa`.*
FROM `siswa`
WHERE `status` = 3
ORDER BY `id` DESC

    public function getAllSiswaBelumAdaKamar()
    {
        $builder = $this->db->table('siswa');
        $builder->select('*');
        $builder->where('status', 3);
        $builder->where('id_kamar', null);
        $builder->orderBy('id', 'DESC');
        $result = $builder->get();
---
SELECT *
FROM `siswa`
WHERE `status` = 3
AND `id_kamar` IS NULL
ORDER BY `id` DESC

    public function getAllSiswaSudahAdaKamar($id_kamar = null)
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*, kamar.nama as nama_kamar, kelas.nama as nama_kelas');
        $builder->groupStart();
        $builder->where('siswa.status', 3);
        $builder->where('id_kamar is NOT NULL', NULL, FALSE);
        $builder->groupEnd();
        if($id_kamar != null) {
            $builder->where('siswa.id_kamar', $id_kamar);
        }
        $builder->join('kamar', 'siswa.id_kamar = kamar.id');
        $builder->join('kelas', 'siswa.id_kelas = kelas.id', 'left');
        $builder->orderBy('id_kamar', 'ASC');
        $result = $builder->get();
---
SELECT `siswa`.*, `kamar`.`nama` as `nama_kamar`, `kelas`.`nama` as `nama_kelas`
FROM `siswa`
JOIN `kamar` ON `siswa`.`id_kamar` = `kamar`.`id`
LEFT JOIN `kelas` ON `siswa`.`id_kelas` = `kelas`.`id`
WHERE   (
`siswa`.`status` = 3
AND id_kamar is NOT NULL
 )
ORDER BY `id_kamar` ASC

    public function getAllSiswaSudahAdaKelas($id_kelas = null)
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*, kelas.nama as nama_kelas, kamar.nama as nama_kamar');
        $builder->groupStart();
        $builder->where('siswa.status', 3);
        $builder->where('id_kelas is NOT NULL', NULL, FALSE);
        $builder->groupEnd();
        if($id_kelas != null) {
            $builder->where('siswa.id_kelas', $id_kelas);
        }
        $builder->join('kelas', 'siswa.id_kelas = kelas.id');
        $builder->join('kamar', 'siswa.id_kamar = kamar.id', 'left');
        $builder->orderBy('id_kelas', 'ASC');
        $result = $builder->get();
---
SELECT `siswa`.*, `kelas`.`nama` as `nama_kelas`, `kamar`.`nama` as `nama_kamar`
FROM `siswa`
JOIN `kelas` ON `siswa`.`id_kelas` = `kelas`.`id`
LEFT JOIN `kamar` ON `siswa`.`id_kamar` = `kamar`.`id`
WHERE   (
`siswa`.`status` = 3
AND id_kelas is NOT NULL
 )
ORDER BY `id_kelas` ASC

    public function getAllMasterSiswa($tahun = null, $status = null)
    {
        $builder = $this->db->table('siswa');
        $builder->select('siswa.*, kelas.nama as nama_kelas, kamar.nama as nama_kamar');
        if($status != null && $status != 4){
        $builder->groupStart();
        $builder->where('siswa.status', $status);
        $builder->groupEnd();
        }elseif ($status == null) {
        $builder->groupStart();
        $builder->where('siswa.status', 3);
        $builder->groupEnd();
        }
        if($tahun != null && $tahun != 'a'){
            $builder->where('tahun_pendaftaran', $tahun);
        }
        $builder->join('kelas', 'siswa.id_kelas = kelas.id', 'left');
        $builder->join('kamar', 'siswa.id_kamar = kamar.id', 'left');
        $builder->orderBy('id_kelas', 'DESC');
        $result = $builder->get();
---
SELECT `siswa`.*, `kelas`.`nama` as `nama_kelas`, `kamar`.`nama` as `nama_kamar`
FROM `siswa`
LEFT JOIN `kelas` ON `siswa`.`id_kelas` = `kelas`.`id`
LEFT JOIN `kamar` ON `siswa`.`id_kamar` = `kamar`.`id`
WHERE   (
`siswa`.`status` = '3'
 )
AND `tahun_pendaftaran` = '2024'
ORDER BY `id_kelas` DESC